lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include <climits>

#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "TIC/Unframer.h"
#include "TicFrameParser.h"

extern "C" {
#include "main.h"
#include <stdio.h>
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
        BSP_LED_On(LED2);
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

typedef void(*FHalDelayRefreshFunc)(void* context);

/**
 * @brief Wait for a given delay in ms, while running a function in background
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param context A context pointer provided to toRunWhileWaiting as argument
 * @param Delay The delay to wait for (in ms)
 * 
 */
void waitDelay(uint32_t Delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, void* context = nullptr) {
    uint32_t tickstart = HAL_GetTick();
    uint32_t wait = Delay;

    /* Add a freq to guarantee minimum wait */
    if (wait < HAL_MAX_DELAY) {
        wait += (uint32_t)(uwTickFreq);
    }

    while((HAL_GetTick() - tickstart) < wait) {
        if (toRunWhileWaiting != nullptr) {
            toRunWhileWaiting(context);
        }
    }
}

struct TicProcessingContext {
    /* Default constructor */
    TicProcessingContext(Stm32SerialDriver& ticSerial, TIC::Unframer& ticUnframer) :
        ticSerial(ticSerial),
        ticUnframer(ticUnframer),
        lostTicBytes(0),
        serialRxOverflowCount(0),
        instantaneousPower(static_cast<uint32_t>(-1)),
        lastParsedFrameNb(static_cast<unsigned int>(-1)) { }

/* Attributes */
    Stm32SerialDriver& ticSerial; /*!< The encapsulated TIC serial bytes receive handler */
    TIC::Unframer& ticUnframer;   /*!< The encapsulated TIC frame delimiter handler */
    unsigned int lostTicBytes;    /*!< How many TIC bytes were lost due to forwarding queue overflow? */
    unsigned int serialRxOverflowCount;  /*!< How many times we didnot read fast enough the serial buffer and bytes where thus lost due to incoming serial buffer overflow */
    uint32_t instantaneousPower;    /*!< A place to store the instantaneous power measurement */
    unsigned int lastParsedFrameNb; /*!< The ID of the last received TIC frame */
};


struct PowerHistoryEntry {
    PowerHistoryEntry() :
        power(),
        horodate(),
        nbSamples(0)
    {
    }

    PowerHistoryEntry(const TicEvaluatedPower& power, const TIC::Horodate& horodate) :
        power(power),
        horodate(horodate),
        nbSamples(1)
    {
    }

    signed int truncateSignedLongToSignedInt(const signed long input) {
        if (input > INT_MAX) {
            return INT_MAX;
        }
        if (input < INT_MIN) {
            return INT_MIN;
        }
        return static_cast<signed int>(input);
    }

    /**
     * @brief Update this object with an average between our current value and a new power measurement sample
     * 
     * @param power A new power measurement sample to take into account
     */
    void averageWithPowerSample(const TicEvaluatedPower& power, const TIC::Horodate& horodate) {
        PowerHistoryEntry result;

        /* If any of the two provided data instances are invalid, discard it and directly return the second one */
        if (!this->power.isValid) {
            this->power = power;
            this->horodate = horodate;
            this->nbSamples = 1;
            return;
        }
        if (!power.isValid)
            return; /* New sample is invalid: do nothing, no new calculation should be performed */

        if (horodate > this->horodate)
            this->horodate = horodate;  /* Update our internal horodate */

        if (this->power.isExact && power.isExact) {
            /* Averaging two exact measurements */
            unsigned int totalNbSample = this->nbSamples + 1;
            unsigned long int averagePower = ((static_cast<unsigned long int>(this->power.minValue) * this->nbSamples) +
                                              static_cast<unsigned long int>(power.minValue)) / static_cast<unsigned long int>(totalNbSample);
            this->power.set(truncateSignedLongToSignedInt(averagePower));
            this->nbSamples = totalNbSample;
            return;
        }

        /* Either first, second or both are no exact values but ranges, the calculation is a bit mode complex */
        unsigned int totalNbSample = this->nbSamples + 1;
        long int averageMinPower = ((static_cast<long int>(this->power.minValue) * this->nbSamples) +
                                    static_cast<long int>(power.minValue)) / static_cast<long int>(totalNbSample);
        long int averageMaxPower = ((static_cast<unsigned long>(this->power.maxValue) * this->nbSamples) +
                                    static_cast<unsigned long>(power.maxValue)) / static_cast<unsigned long>(totalNbSample);
        /* We now get a high and low boundary (a range) for power value */

        /* Prior average and/or the new value are estimations, take min and max as they have been calculated */
        this->power.setMinMax(truncateSignedLongToSignedInt(averageMinPower), truncateSignedLongToSignedInt(averageMaxPower));
        this->nbSamples = totalNbSample;
        return;
    }

/* Attributes */
    TicEvaluatedPower power; /*!< A power (in multiples or fractions of W... see scale below) */
    TIC::Horodate horodate; /*!< The horodate for the @p power entry */
    unsigned int nbSamples; /*!< The number of samples that have been averaged to produce the value in @p power */
    unsigned int scale; /*!< A divider for @p power. If scale=1000, then power is represented in mW */
};

