lains/stm32-linky-display/src/main.cpp
struct PowerHistory {
    /* Types */
    typedef enum {
        PerSecond = 0,
        Per5Seconds,
        Per10Seconds,
        Per15Seconds,
        Per30Seconds,
        PerMinute,
        AveraginOverMinutesOrMore = PerMinute,
        Per5Minutes,
    } AveragingMode;

    PowerHistory(AveragingMode averagingPeriod) :
        data(),
        averagingPeriod(averagingPeriod),
        lastPowerHorodate()
    {
    }

    void onNewPowerData(const TicEvaluatedPower& power, const TIC::Horodate& horodate) {
        if (!power.isValid || !horodate.isValid) {
            return;
        }
        if (this->horodatesAreInSamePeriodSample(horodate, this->lastPowerHorodate)) {
            PowerHistoryEntry* lastEntry = this->data.getPtrToLast();
            if (lastEntry != nullptr) {
                lastEntry->averageWithPowerSample(power, horodate);
                this->lastPowerHorodate = horodate;
                return;
            }
            /* If lastEntry is not valid, create a new entry by falling-through the following code */
        }
        this->data.push(PowerHistoryEntry(power, horodate)); /* First sample in this period */
        this->lastPowerHorodate = horodate;
    }

    bool horodatesAreInSamePeriodSample(const TIC::Horodate& first, const TIC::Horodate& second) {
        if (first.year != second.year ||
            first.month != second.month ||
            first.day != second.day ||
            first.hour != second.hour)
            return false; /* Period is different whenever anything longer than one hour is different between the two horodates */
        if (this->averagingPeriod >= AveraginOverMinutesOrMore) { /* We are averaging over at least 1 minute, so only compare minutes */
            switch (this->averagingPeriod) {
                case PerMinute:
                    return (first.minute == second.minute); /* Minutes should be equal to be in the same sampling period */
                case Per5Minutes:
                    if (first.minute > second.minute) {
                        return ((first.minute - second.minute) < 5);
                    }
                    else {
                        return ((second.minute - first.minute) < 5);
                    }
                default:    /* Unsupported averaging period */
                    return false;
            }
        }
        /* If we fall here, we are averaging over less than 1 minute */
        if (first.minute != second.minute)
            return false; /* Period is different whenever the minute is different between the two horodates */
        unsigned int maxPeriodDeltaInSeconds = 0;
        switch (this->averagingPeriod) {
            case PerSecond:
                maxPeriodDeltaInSeconds = 1;
                break;
            case Per5Seconds:
                maxPeriodDeltaInSeconds = 5;
                break;
            case Per10Seconds:
                maxPeriodDeltaInSeconds = 10;
                break;
            case Per15Seconds:
                maxPeriodDeltaInSeconds = 15;
                break;
            case Per30Seconds:
                maxPeriodDeltaInSeconds = 30;
                break;
            default:    /* All other possible periods are over one minute, they have been handled above, this block should never be reached */
                return false;
        }
        unsigned int delta;
        if (first.second > second.second) {
            delta = first.second - second.second;
        }
        else {
            delta = second.second - first.second;
        }
        return (delta < maxPeriodDeltaInSeconds);
    }

    /**
     * @brief Utility function to unwrap a TicFrameParser instance and invoke onDatasetExtracted() on it
     * It is used as a callback provided to TIC::DatasetExtractor
     * 
     * @param context A context as provided by TIC::DatasetExtractor, used to retrieve the wrapped TicFrameParser instance
     */
    static void unWrapOnNewPowerData(const TicEvaluatedPower& power, const TIC::Horodate& horodate, void* context) {
        if (context == nullptr)
            return; /* Failsafe, discard if no context */
        PowerHistory* powerHistoryInstance = static_cast<PowerHistory*>(context);
        /* We have finished parsing a frame, if there is an open dataset, we should discard it and start over at the following frame */
        powerHistoryInstance->onNewPowerData(power, horodate);
    }

    /**
     * @brief Get the Last Values object
     * 
     * @param[in,out] nb The max number of measurements requested, modified at return to represent the number of measurements actually retrieved
     * @param[out] result A C-array of results, the first one being the most recent
     * 
     * @note The horodate of the most recent entry can be retrieved in the first element of the result array (if nb!=0 at return)
     */
    void getLastPower(unsigned int& nb, PowerHistoryEntry* result) const {
        if (nb > this->data.getCount())
            nb = this->data.getCount();   /* Saturate to the number of actual values we hold */
        for (unsigned int reversePos = 0; reversePos < nb; reversePos++) {
            result[reversePos] = this->data.getReverse(reversePos);
        }
    }

/* Attributes */
    FixedSizeRingBuffer<PowerHistoryEntry, 1024> data;    /*!< The last n instantaneous power measurements */
    AveragingMode averagingPeriod; /*!< Which sampling period do we record (we will perform an average on all samples within the period) */
    TIC::Horodate lastPowerHorodate;    /*!< The horodate of the last received power measurement */
};

void drawHistory(Stm32LcdDriver& lcd, uint16_t x, uint16_t y, uint16_t width, uint16_t height, const PowerHistory& history) {
    unsigned int nbSamples = width; /* Initially try to fill-in all the area */
    PowerHistoryEntry powerMeasurements[nbSamples];
    history.getLastPower(nbSamples, powerMeasurements);
    if (nbSamples > width) {    /* Sanity, should never occur */
        nbSamples = width;
    }
    uint8_t pos = 0;
    char statusLine[]="DH=@@@@";
    pos+=3; // "DH="
    statusLine[pos++]=(nbSamples / 1000) % 10 + '0';
    statusLine[pos++]=(nbSamples / 100) % 10 + '0';
    statusLine[pos++]=(nbSamples / 10) % 10 + '0';
    statusLine[pos++]=(nbSamples / 1) % 10 + '0';
    pos++;
    auto get_font24_ptr = [](const char c) {
        unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
        return &(Font24.table[(c-' ') * bytesPerGlyph]);
    };
    
